Revit 2024 API
LinkedResourceOpeningEventArgs Properties
The LinkedResourceOpeningEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
LinkedResourcePathName
 Path of the linked resource.
ResourceType
 The desired linked resource type.
See Also
LinkedResourceOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace